# Написать программу, которая считывает целое число
# и выводит значение, которое в два раза больше, чем введенное.

value = int(input('Введи число:')) * 2
print(value)

# Написать программу, которая считывает число с точкой и выводит значение,
# которое в два раза больше, чем введенное.

value = float(input('Введи число:')) * 2
print(value)

# Написать программу, которая считывает строку и выводит удвоенную эту строку

value = input('Введи чтото:') * 2
print(value)